public class Main {
    public static void main(String[] args) {
        task1();
        task2();
        task3();
    }

//    Реализуйте метод, который получает в качестве параметра год, проверяет, является ли он високосным, и выводит результат в консоль.
//    Эту проверку вы уже реализовывали в задании по условным операторам.
//    Теперь проверку оберните в метод и используйте год, который приходит в виде параметра.
//    Результат программы выведите в консоль. Если год високосный, то напечатайте сообщение: «...  год — високосный год».
//    Если год невисокосный, то: «... год — невисокосный год».

    public static void task1() {
        System.out.println("Задача 1");

    }


    public static void task2() {
        System.out.println("Задача 2");

    }



    public static void task3() {
        System.out.println("Задача 3");

    }
}